<a href="https://colab.research.google.com/github/TharllesHCS/DATASCIENCE-Python/blob/master/DataScience_ML_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
"""

Esse notbook possui conteudo exclusivo de Pandas que usado é no mundo de Machine Learn

"""
import pandas as pd
import numpy as np

In [ ]:
s =pd.Series([1,4,5,6,7,10,6])
print("Aqui e a primeira lista usando pandas: \n {}".format(s))
m = pd.Series([[2,3],[4,5],[5,6]])
print("\nAqui e a primeira matriz usando pandas: \n {}\n\n".format(m))


print("\n\nAquie mostra-se o valor da posição 0:\n{}".format(s[0]))
print("\n\nAquie mostra-se o valor de 2 a 3:\n{}".format(s[2:4]))
print("\n\nAquie mostra-se a descrição da lista (ou matriz) :\n{}".format(s.describe()))
print("\n\nAquie mostra-se o valor da media :\n{}".format(s.mean()))
print("\n\nAquie mostra-se o valor da mediana :\n{}".format(s.median()))

print("\n\nAquie mostra-se se a valor duplicado :\n{}".format(s.duplicated()))


s2 = pd.Series([11,5,8])
print("\n\nAquie junta-se a lista 1 e a 2 :\n{}".format(s.append(s2)))

Aqui e a primeira lista usando pandas:
 0     1
1     4
2     5
3     6
4     7
5    10
6     6
dtype: int64

Aqui e a primeira matriz usando pandas:
 0    [2, 3]
1    [4, 5]
2    [5, 6]
dtype: object




Aquie mostra-se o valor da posição 0:
1


Aquie mostra-se o valor de 2 a 3:
2    5
3    6
dtype: int64


Aquie mostra-se a descrição da lista (ou matriz) :
count     7.000000
mean      5.571429
std       2.760262
min       1.000000
25%       4.500000
50%       6.000000
75%       6.500000
max      10.000000
dtype: float64


Aquie mostra-se o valor da media :
5.571428571428571


Aquie mostra-se o valor da mediana :
6.0


Aquie mostra-se se a valor duplicado :
0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool


Aquie junta-se a lista 1 e a 2 :
0     1
1     4
2     5
3     6
4     7
5    10
6     6
0    11
1     5
2     8
dtype: int64

In [ ]:
"""

Trabalhando como dataframes no Python 
Vale lembrar, que dataframe é algo utilizado no R, com a lib pandas
foi feito a adaptação pra que possa ser utilizado da mesma forma no
python, dataframe nada mais é do que uma matriz ou lista

"""
df= pd.DataFrame(
    [['fcholle/keras',11302],['openl/universe', 4350],['pandas-dev/pandas',8168]]
)

df.shape

(3, 2)

In [ ]:
df

                   0      1
0      fcholle/keras  11302
1     openl/universe   4350
2  pandas-dev/pandas   8168

In [ ]:
df= pd.DataFrame(
    [['fcholle/keras',11302],['openl/universe', 4350],['pandas-dev/pandas',8168]],
    columns=['repository','stars']

)
df

          repository  stars
0      fcholle/keras  11302
1     openl/universe   4350
2  pandas-dev/pandas   8168

In [ ]:
df['stars']

0    11302
1     4350
2     8168
Name: stars, dtype: int64

In [ ]:
df['repository']

0        fcholle/keras
1       openl/universe
2    pandas-dev/pandas
Name: repository, dtype: object

In [ ]:
df['stars'].mean()
## Media da coluna Stars

7940.0

In [ ]:
df['stars'].median()
#mediana da coluna stars

8168.0

In [ ]:
df.iloc[1]
# iloc traz uma linha travada junto de suas colunas, devolvendo um dataframe
# que pode acessar as colunas atraves de seus indices
# df.iloc[1]['stars]

# df.ix[1]
# Retorna o indice do data frame, que pode ser tanto numero quanto str
# o indice pode ser alterado, com: df.index = df['Sigla']
# no exemplo acima, a coluna index é ajustada ao conteudo de sigla,
# tornando necessário deletar a coluna sigla por causa da duplicação da coluna
# index e sigla, com: del df['sigla']
# iloc retonra posição

repository    openl/universe
stars                   4350
Name: 1, dtype: object

In [ ]:
## pydataset.data()
## retorna um conjunto de datasets para brincar, rsrs
#!pip install pydataset - windows
#!get install pydata - linux
import pydataset as pydata

pydata.data()

titanic = pydata.data('titanic')

titanic.head()

       class     age  sex survived
1  1st class  adults  man      yes
2  1st class  adults  man      yes
3  1st class  adults  man      yes
4  1st class  adults  man      yes
5  1st class  adults  man      yes

In [ ]:
titanic.tail()

          class    age    sex survived
1312  3rd class  child  women       no
1313  3rd class  child  women       no
1314  3rd class  child  women       no
1315  3rd class  child  women       no
1316  3rd class  child  women       no

In [ ]:
titanic.describe()

            class     age   sex survived
count        1316    1316  1316     1316
unique          3       2     2        2
top     3rd class  adults   man       no
freq          706    1207   869      817

In [ ]:
titanic['class'].value_counts()

3rd class    706
1st class    325
2nd class    285
Name: class, dtype: int64

In [ ]:
## pydataset.data() possui 757 bancos de dados que podem ser utilizados.

In [ ]:
"""
Para carregar dataframes com conteudos de bancos de dados, é utilizada a lib
db.py, ela possibilita conectar a diversos bancos de diversas tecnologias, já
convertendo para dataframe no pandas
pip install db
get install db
"""
#!pip install db.py
#!get install db.py

'\nPara carregar dataframes com conteudos de bancos de dados, é utilizada a lib\ndb.py, ela possibilita conectar a diversos bancos de diversas tecnologias, já\nconvertendo para dataframe no pandas\npip install db\nget install db\n'

In [ ]:
from db import DB

In [ ]:
database= DB(filename='logs.sqlite3',dbtype='sqlite',)
#database.tables
#log_df=database.tables.log
#log_df banco de dados
#log_df = database.tables.log.all() agora é um dataframe
# log_df = database.query('select * from log where user_id = 3') usando query no db

Indexing schema. This will take a second...finished!

In [ ]:
"""

Carregar CSV no pandar, em forma de DATAFRAME
lib pra ler xlrd
lib para escrever xlwt
!pip install xlrd
!pip install xlwt
"""

copacabana = pd.read_csv('copacabana.csv', delimiter=';')

In [ ]:
"""

Carregar Excel no pandar, em forma de DATAFRAME

"""

#pd_excel = pd.read_excel('arquivo.xls')

In [ ]:
copacabana.columns
#ver as colunas do dataframe

Index(['Posicao', 'Quartos', 'Vagas', 'DistIpanema', 'DistPraia', 'DistFavela',
       'RendaMedia', 'RendaMovel', 'RendaMovelRua', 'Vu2009', 'Mes', 'Idade',
       'Tipologia', 'AreaConstruida', 'VAL_UNIT', 'X', 'Y'],
      dtype='object')

In [ ]:
copacabana['Quartos'].describe()
# ver detalhes contidos dentro de uma coluna "Quartos"

count    1675.000000
mean        1.767510
std         1.142523
min         0.010000
25%         1.000000
50%         2.000000
75%         3.000000
max         6.000000
Name: Quartos, dtype: float64

In [ ]:
copacabana.loc[copacabana['Quartos'] == 5]
##Realizar filtragem de dados usando Pandas

      Posicao  Quartos  Vagas  ...  VAL_UNIT            X           Y
173         1      5.0   0.01  ...      6316  686522.9800  7458989.87
1521        1      5.0   3.00  ...      5000  686965.3201  7459109.71

[2 rows x 17 columns]

In [96]:
copacabana['total']= copacabana['AreaConstruida'] * copacabana['VAL_UNIT']
copacabana['total']
#multiplicação de colunas

0       416005
1       460009
2       720012
3       990000
4       909976
         ...
1670    479940
1671    402040
1672    600020
1673    766705
1674    683871
Name: total, Length: 1675, dtype: int64